export const testInfo = {
  title: '16-ТИ ФАКТОРНЫЙ ЛИЧНОСТНЫЙ ОПРОСНИК КЕТТЕЛЛА',
  description: (
    <>
      Вам предлагается ряд вопросов, которые помогут определить некоторые свойства Вашей личности. Здесь не
      может быть ответов «правильных» или «ошибочных». Люди различны, и каждый может высказать свое мнение.
      <br />
      Отвечая на каждый вопрос, Вы должны выбрать один из трех предлагаемых ответов - тот, который в
      наибольшей степени соответствует Вашим взглядам, Вашему мнению о себе. Отвечать надо следующим образом:
      в соответствующей клеточке на бланке для ответов ставьте крестик (левая клеточка соответствует ответу
      «а», средняя - ответу «б», а клеточка справа - ответу «с»).
    </>
  ),
};
