export const testInfo = {
  title: 'Тест Д.Голланда по определению типа личности',
  description:
    'Изучая индивидуальные особенности людей, психолог Голланд разработал методику для определения социальной направленности личности (социального характерологического типа), выделив шесть типов:',
};

export const personalityTypes = [
  'Реалистический тип (Р)',
  'Интеллектуальный тип (И)',
  'Социальный тип (С)',
  'Конвенциальный тип (К)',
  'Предприимчивый тип (П)',
  'Артистический тип (А)',
];

export const personalityType = {
  'Реалистический тип': [
    '1a',
    '2a',
    '3a',
    '4a',
    '5a',
    '16a',
    '17a',
    '18a',
    '19a',
    '21a',
    '31a',
    '32a',
    '33a',
    '34a',
  ],
  'Интеллектуальный тип': [
    '1b',
    '6a',
    '7a',
    '8a',
    '9a',
    '16b',
    '20a',
    '22a',
    '23a',
    '24a',
    '31b',
    '35a',
    '36a',
    '37a',
  ],
  'Социальный тип': [
    '2b',
    '6b',
    '10a',
    '11a',
    '12a',
    '17b',
    '29b',
    '25a',
    '26a',
    '27a',
    '36b',
    '38a',
    '39a',
    '41b',
  ],
  'Конвенциальный тип': [
    '3b',
    '7b',
    '10b',
    '13a',
    '14a',
    '18b',
    '22b',
    '25b',
    '28a',
    '29a',
    '32b',
    '38b',
    '40a',
    '42a',
  ],
  'Предприимчивый тип': [
    '4b',
    '8b',
    '11b',
    '13b',
    '15a',
    '23b',
    '28b',
    '30a',
    '33b',
    '35b',
    '37b',
    '39b',
    '40b',
  ],
  'Артистический тип': [
    '5b',
    '9b',
    '12b',
    '14b',
    '15b',
    '19b',
    '21b',
    '24a',
    '27b',
    '29b',
    '30b',
    '34b',
    '41a',
    '42b',
  ],
};

export const personalityTypeInfo = [
  {
    Тип: 'Р',
    'Психологические характеристики, особенности личности, способности':
      'Активность, агрессивность, деловитость, настойчивость, рациональность, практическое мышление, развитые двигательные навыки, пространственное воображение, технические способности',
    'Ориентация, направленность, предпочтения':
      'Конкретный результат, настоящее, вещи, предметы и их практическое использование, занятия, требующие физического развития, ловкости, отсутствие ориентации на общение',
    'Профессиональная среда':
      'Техника, сельское хозяйство, военное дело. Решение конкретных задач, требующих подвижности, двигательных умений, физической силы. Социальные навыки нужны в минимальной мере и связаны с приемом – передачей ограниченной информации.',
    'Конкретные профессии':
      'механик, электрик, инженер, фермер, зоотехник, агроном, садовод, автослесарь, шофер и т.д.',
  },
  {
    Тип: 'И',
    'Психологические характеристики, особенности личности, способности':
      'Аналитический ум, независимость и оригинальность суждений, гармоничное развитие языковых и математических способностей, критичность, любознательность, склонность к фантазии, интенсивная внутренняя жизнь, низкая физическая активность',
    'Ориентация, направленность, предпочтения':
      'Идеи, теоретические ценности, умственный труд, решение интеллектуальных творческих задач, требующих абстрактного мышления, отсутствие ориентации на общение в деятельности, информационный характер общения',
    'Профессиональная среда':
      'Наука. Решение задач, требующих абстрактного мышления и творческих способностей. Межличностные отношения играют незначительную роль, хотя необходимо уметь передавать и воспринимать сложные идеи',
    'Конкретные профессии': 'физик, астроном, ботаник, программист и др.',
  },
  {
    Тип: 'С',
    'Психологические характеристики, особенности личности, способности':
      'Умение общаться, гуманность, способность к сопереживанию, активность, зависимость от окружающих и общественного мнения, приспособление, решение проблем с опорой на эмоции и чувства, преобладание языковых способностей',
    'Ориентация, направленность, предпочтения':
      'Люди, общение, установление контактов с окружающими, стремление учить, воспитывать, избегание интеллектуальных проблем',
    'Профессиональная среда':
      'Образование, здравоохранение, социальное обеспечение, обслуживание, спорт. Ситуации и проблемы, связанные с умением разбираться в поведении людей, требующие постоянного личного общения, умения убеждать.',
    'Конкретные профессии': 'врач, педагог, психолог и т.п.',
  },
  {
    Тип: 'К',
    'Психологические характеристики, особенности личности, способности':
      'Способности к переработке числовой информации, стереотипный подход к проблемам, консервативный характер, подчиняемость, зависимость, следование обычаям, конформность, исполнительность, преобладание математических способностей',
    'Ориентация, направленность, предпочтения':
      'Порядок, четко расписанная деятельность, работа по инструкции, заданным алгоритмам, избегание неопределенных ситуаций, социальной активности и физического напряжения, принятие позиции руководства',
    'Профессиональная среда':
      'Экономика, связь, расчеты, бухгалтерия, делопроизводство. Деятельность, требующая способностей к обработке рутинной информации и числовых данных',
    'Конкретные профессии': 'бухгалтер, финансист, экономист, канцелярский служащий и др.',
  },
  {
    Тип: 'П',
    'Психологические характеристики, особенности личности, способности':
      'Энергия, импульсивность, энтузиазм, предприимчивость, агрессивность, готовность к риску, оптимизм, уверенность в себе, преобладание языковых способностей, развитые организаторские способности',
    'Ориентация, направленность, предпочтения':
      'Лидерство, признание, руководство, власть, личный статус, избегание занятий, требующих усидчивости, большого труда, двигательных навыков и концентрации внимания, интерес к экономике и политике',
    'Профессиональная среда':
      'Решение неясных задач, общение с представителями различных типов в разнообразных ситуациях, требующих умения разбираться в мотивах поведения других людей и красноречия',
    'Конкретные профессии':
      'бизнесмен, маркетолог, менеджер, директор, заведующий, журналист, репортер, дипломат, юрист, политик и т.д.',
  },
  {
    Тип: 'А',
    'Психологические характеристики, особенности личности, способности':
      'Воображение и интуиция, эмоционально сложный взгляд на жизнь, независимость, гибкость и оригинальность мышления, развитые двигательные способности и восприятие',
    'Ориентация, направленность, предпочтения':
      'Эмоции и чувства, самовыражение, творческие занятия, избегание деятельности, требующей физической силы, регламентированного рабочего времени, следования правилам и традициям',
    'Профессиональная среда':
      'Изобразительное искусство, музыка, литература. Решение проблем, требующих художественного вкуса и воображения',
    'Конкретные профессии': 'музыкант, художник, фотограф, актер, режиссер, дизайнер и т.д.',
  },
];
